; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v8 ?v9)
             (pred_10 ?v13 ?v7)
             (pred_9 ?v8 ?v7)
             (pred_5 ?v1 ?v8 )
	     (pred_2 ?v8)
             (pred_11 ?v6)
             (pred_6 ?v13)
             (pred_8 ?v7)
             (pred_4 ?v8)
             (pred_12 ?v13)
             (pred_1 ?v8)
             (pred_3 ))



(:action op_1
:parameters (?v4 ?v5 ?v12 ?v11)
:precondition (and (pred_11 ?v4) (pred_11 ?v5) (pred_6 ?v12) (pred_8 ?v11)
          (pred_7 ?v4 ?v5) (pred_10 ?v12 ?v11)
                   (pred_9 ?v5 ?v11) (pred_2 ?v4) 
                   (pred_4 ?v5) (pred_12 ?v12))
:effect (and  (pred_1 ?v5) (not (pred_4 ?v5))))


(:action op_2
:parameters (?v4 ?v2)
:precondition (and (pred_11 ?v4) (pred_11 ?v2)
               (pred_2 ?v4) (pred_7 ?v4 ?v2) (pred_1 ?v2))
:effect (and (pred_2 ?v2) (not (pred_2 ?v4))))

(:action op_4
:parameters (?v4 ?v12)
:precondition (and (pred_11 ?v4) (pred_6 ?v12) 
                  (pred_2 ?v4) (pred_5 ?v12 ?v4) (pred_3 ))
:effect (and (pred_12 ?v12)
   (not (pred_5 ?v12 ?v4)) (not (pred_3 ))))


(:action op_5
:parameters (?v4 ?v10 ?v3)
:precondition (and (pred_11 ?v4) (pred_6 ?v10) (pred_6 ?v3)
                  (pred_2 ?v4) (pred_12 ?v3) (pred_5 ?v10 ?v4))
:effect (and (pred_12 ?v10) (pred_5 ?v3 ?v4)
        (not (pred_12 ?v3)) (not (pred_5 ?v10 ?v4))))

(:action op_3
:parameters (?v4 ?v12)
:precondition (and (pred_11 ?v4) (pred_6 ?v12) 
                  (pred_2 ?v4) (pred_12 ?v12))
:effect (and (pred_3 ) (pred_5 ?v12 ?v4) (not (pred_12 ?v12)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_04 obj_18 obj_03 obj_02 obj_11 obj_07 obj_17 obj_05 obj_06 obj_15 obj_01 obj_16 obj_09 obj_20 obj_08 obj_12
    obj_10 obj_19
    obj_14 obj_13
    )

    (:init
       (pred_3)

       (pred_11 obj_04)
       (pred_11 obj_18)
       (pred_11 obj_03)
       (pred_11 obj_02)
       (pred_11 obj_11)
       (pred_11 obj_07)
       (pred_11 obj_17)
       (pred_11 obj_05)
       (pred_11 obj_06)
       (pred_11 obj_15)
       (pred_11 obj_01)
       (pred_11 obj_16)
       (pred_11 obj_09)
       (pred_11 obj_20)
       (pred_11 obj_08)
       (pred_11 obj_12)
       (pred_8 obj_10)
       (pred_8 obj_19)
       (pred_6 obj_14)
       (pred_6 obj_13)

       (pred_7 obj_04 obj_11)
       (pred_7 obj_04 obj_18)
       (pred_7 obj_18 obj_07)
       (pred_7 obj_18 obj_03)
       (pred_7 obj_18 obj_04)
       (pred_7 obj_03 obj_17)
       (pred_7 obj_03 obj_02)
       (pred_7 obj_03 obj_18)
       (pred_7 obj_02 obj_05)
       (pred_7 obj_02 obj_03)
       (pred_7 obj_11 obj_06)
       (pred_7 obj_11 obj_07)
       (pred_7 obj_11 obj_04)
       (pred_7 obj_07 obj_15)
       (pred_7 obj_07 obj_17)
       (pred_7 obj_07 obj_18)
       (pred_7 obj_07 obj_11)
       (pred_7 obj_17 obj_01)
       (pred_7 obj_17 obj_05)
       (pred_7 obj_17 obj_03)
       (pred_7 obj_17 obj_07)
       (pred_7 obj_05 obj_16)
       (pred_7 obj_05 obj_02)
       (pred_7 obj_05 obj_17)
       (pred_7 obj_06 obj_09)
       (pred_7 obj_06 obj_15)
       (pred_7 obj_06 obj_11)
       (pred_7 obj_15 obj_20)
       (pred_7 obj_15 obj_01)
       (pred_7 obj_15 obj_07)
       (pred_7 obj_15 obj_06)
       (pred_7 obj_01 obj_08)
       (pred_7 obj_01 obj_16)
       (pred_7 obj_01 obj_17)
       (pred_7 obj_01 obj_15)
       (pred_7 obj_16 obj_12)
       (pred_7 obj_16 obj_05)
       (pred_7 obj_16 obj_01)
       (pred_7 obj_09 obj_20)
       (pred_7 obj_09 obj_06)
       (pred_7 obj_20 obj_08)
       (pred_7 obj_20 obj_15)
       (pred_7 obj_20 obj_09)
       (pred_7 obj_08 obj_12)
       (pred_7 obj_08 obj_01)
       (pred_7 obj_08 obj_20)
       (pred_7 obj_12 obj_16)
       (pred_7 obj_12 obj_08)
       (pred_4 obj_06)
       (pred_4 obj_04)
       (pred_9  obj_06 obj_10)
       (pred_9  obj_04 obj_19)
       (pred_1 obj_18)
       (pred_1 obj_03)
       (pred_1 obj_02)
       (pred_1 obj_11)
       (pred_1 obj_07)
       (pred_1 obj_17)
       (pred_1 obj_05)
       (pred_1 obj_15)
       (pred_1 obj_01)
       (pred_1 obj_16)
       (pred_1 obj_09)
       (pred_1 obj_20)
       (pred_1 obj_08)
       (pred_1 obj_12)

       (pred_10  obj_14 obj_10)
       (pred_10  obj_13 obj_19)
       (pred_5 obj_14 obj_12)
       (pred_5 obj_13 obj_12)
       (pred_2 obj_07)
    )

    (:goal (and
       (pred_5 obj_14 obj_11)
       (pred_5 obj_13 obj_18)
    ))
(:constraints
  (always (not (pred_2 obj_16)))
)
)

; plan
1. (op_2 obj_07 obj_15)
   deleted: (pred_2 obj_07)
   added: (pred_2 obj_15)
   goals met: 0 of 2
2. (op_2 obj_15 obj_20)
   deleted: (pred_2 obj_15)
   added: (pred_2 obj_20)
   goals met: 0 of 2
3. (op_2 obj_20 obj_08)
   deleted: (pred_2 obj_20)
   added: (pred_2 obj_08)
   goals met: 0 of 2
4. (op_2 obj_08 obj_12)
   deleted: (pred_2 obj_08)
   added: (pred_2 obj_12)
   goals met: 0 of 2
5. (op_4 obj_12 obj_14)
   deleted: (pred_5 obj_14 obj_12) (pred_3)
   added: (pred_12 obj_14)
   goals met: 0 of 2
6. (op_2 obj_12 obj_08)
   deleted: (pred_2 obj_12)
   added: (pred_2 obj_08)
   goals met: 0 of 2
7. (op_2 obj_08 obj_20)
   deleted: (pred_2 obj_08)
   added: (pred_2 obj_20)
   goals met: 0 of 2
8. (op_2 obj_20 obj_15)
   deleted: (pred_2 obj_20)
   added: (pred_2 obj_15)
   goals met: 0 of 2
9. (op_2 obj_15 obj_07)
   deleted: (pred_2 obj_15)
   added: (pred_2 obj_07)
   goals met: 0 of 2
10. (op_2 obj_07 obj_11)
   deleted: (pred_2 obj_07)
   added: (pred_2 obj_11)
   goals met: 0 of 2
11. (op_3 obj_11 obj_14)
   deleted: (pred_12 obj_14)
   added: (pred_3) (pred_5 obj_14 obj_11)
   goals met: 1 of 2
12. (op_2 obj_11 obj_07)
   deleted: (pred_2 obj_11)
   added: (pred_2 obj_07)
   goals met: 1 of 2
13. (op_2 obj_07 obj_15)
   deleted: (pred_2 obj_07)
   added: (pred_2 obj_15)
   goals met: 1 of 2
14. (op_2 obj_15 obj_01)
   deleted: (pred_2 obj_15)
   added: (pred_2 obj_01)
   goals met: 1 of 2
15. (op_2 obj_01 obj_08)
   deleted: (pred_2 obj_01)
   added: (pred_2 obj_08)
   goals met: 1 of 2
16. (op_2 obj_08 obj_12)
   deleted: (pred_2 obj_08)
   added: (pred_2 obj_12)
   goals met: 1 of 2
17. (op_4 obj_12 obj_13)
   deleted: (pred_5 obj_13 obj_12) (pred_3)
   added: (pred_12 obj_13)
   goals met: 1 of 2
18. (op_2 obj_12 obj_08)
   deleted: (pred_2 obj_12)
   added: (pred_2 obj_08)
   goals met: 1 of 2
19. (op_2 obj_08 obj_01)
   deleted: (pred_2 obj_08)
   added: (pred_2 obj_01)
   goals met: 1 of 2
20. (op_2 obj_01 obj_17)
   deleted: (pred_2 obj_01)
   added: (pred_2 obj_17)
   goals met: 1 of 2
21. (op_2 obj_17 obj_03)
   deleted: (pred_2 obj_17)
   added: (pred_2 obj_03)
   goals met: 1 of 2
22. (op_2 obj_03 obj_18)
   deleted: (pred_2 obj_03)
   added: (pred_2 obj_18)
   goals met: 1 of 2
23. (op_3 obj_18 obj_13)
   deleted: (pred_12 obj_13)
   added: (pred_3) (pred_5 obj_13 obj_18)
   goals met: 2 of 2
